hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gpioc.h
#define	GPIOC_OSPEEDR_OSPEED15				(0x3u<<30)
#define	GPIOC_OSPEEDR_OSPEED15_0			(0x1u<<30)
#define	GPIOC_OSPEEDR_OSPEED14				(0x3u<<28)
#define	GPIOC_OSPEEDR_OSPEED14_0			(0x1u<<28)
#define	GPIOC_OSPEEDR_OSPEED13				(0x3u<<26)
#define	GPIOC_OSPEEDR_OSPEED13_0			(0x1u<<26)
#define	GPIOC_OSPEEDR_OSPEED12				(0x3u<<24)
#define	GPIOC_OSPEEDR_OSPEED12_0			(0x1u<<24)
#define	GPIOC_OSPEEDR_OSPEED11				(0x3u<<22)
#define	GPIOC_OSPEEDR_OSPEED11_0			(0x1u<<22)
#define	GPIOC_OSPEEDR_OSPEED10				(0x3u<<20)
#define	GPIOC_OSPEEDR_OSPEED10_0			(0x1u<<20)
#define	GPIOC_OSPEEDR_OSPEED9				(0x3u<<18)
#define	GPIOC_OSPEEDR_OSPEED9_0				(0x1u<<18)
#define	GPIOC_OSPEEDR_OSPEED8				(0x3u<<16)
#define	GPIOC_OSPEEDR_OSPEED8_0				(0x1u<<16)
#define	GPIOC_OSPEEDR_OSPEED7				(0x3u<<14)
#define	GPIOC_OSPEEDR_OSPEED7_0				(0x1u<<14)
#define	GPIOC_OSPEEDR_OSPEED6				(0x3u<<12)
#define	GPIOC_OSPEEDR_OSPEED6_0				(0x1u<<12)
#define	GPIOC_OSPEEDR_OSPEED5				(0x3u<<10)
#define	GPIOC_OSPEEDR_OSPEED5_0				(0x1u<<10)
#define	GPIOC_OSPEEDR_OSPEED4				(0x3u<<8)
#define	GPIOC_OSPEEDR_OSPEED4_0				(0x1u<<8)
#define	GPIOC_OSPEEDR_OSPEED3				(0x3u<<6)
#define	GPIOC_OSPEEDR_OSPEED3_0				(0x1u<<6)
#define	GPIOC_OSPEEDR_OSPEED2				(0x3u<<4)
#define	GPIOC_OSPEEDR_OSPEED2_0				(0x1u<<4)
#define	GPIOC_OSPEEDR_OSPEED1				(0x3u<<2)
#define	GPIOC_OSPEEDR_OSPEED1_0				(0x1u<<2)
#define	GPIOC_OSPEEDR_OSPEED0				(0x3u<<0)
#define	GPIOC_OSPEEDR_OSPEED0_0				(0x1u<<0)

#define	GPIOC_OSPEEDR_OSPEED15_B_0X0		(0x0u<<30)
#define	GPIOC_OSPEEDR_OSPEED15_B_0X1		(0x1u<<30)
#define	GPIOC_OSPEEDR_OSPEED15_B_0X2		(0x2u<<30)
#define	GPIOC_OSPEEDR_OSPEED15_B_0X3		(0x3u<<30)
#define	GPIOC_OSPEEDR_OSPEED14_B_0X0		(0x0u<<28)
#define	GPIOC_OSPEEDR_OSPEED14_B_0X1		(0x1u<<28)
#define	GPIOC_OSPEEDR_OSPEED14_B_0X2		(0x2u<<28)
#define	GPIOC_OSPEEDR_OSPEED14_B_0X3		(0x3u<<28)
#define	GPIOC_OSPEEDR_OSPEED13_B_0X0		(0x0u<<26)
#define	GPIOC_OSPEEDR_OSPEED13_B_0X1		(0x1u<<26)
#define	GPIOC_OSPEEDR_OSPEED13_B_0X2		(0x2u<<26)
#define	GPIOC_OSPEEDR_OSPEED13_B_0X3		(0x3u<<26)
#define	GPIOC_OSPEEDR_OSPEED12_B_0X0		(0x0u<<24)
#define	GPIOC_OSPEEDR_OSPEED12_B_0X1		(0x1u<<24)
#define	GPIOC_OSPEEDR_OSPEED12_B_0X2		(0x2u<<24)
#define	GPIOC_OSPEEDR_OSPEED12_B_0X3		(0x3u<<24)
#define	GPIOC_OSPEEDR_OSPEED11_B_0X0		(0x0u<<22)
#define	GPIOC_OSPEEDR_OSPEED11_B_0X1		(0x1u<<22)
#define	GPIOC_OSPEEDR_OSPEED11_B_0X2		(0x2u<<22)
#define	GPIOC_OSPEEDR_OSPEED11_B_0X3		(0x3u<<22)
#define	GPIOC_OSPEEDR_OSPEED10_B_0X0		(0x0u<<20)
#define	GPIOC_OSPEEDR_OSPEED10_B_0X1		(0x1u<<20)
#define	GPIOC_OSPEEDR_OSPEED10_B_0X2		(0x2u<<20)
#define	GPIOC_OSPEEDR_OSPEED10_B_0X3		(0x3u<<20)
#define	GPIOC_OSPEEDR_OSPEED9_B_0X0			(0x0u<<18)
#define	GPIOC_OSPEEDR_OSPEED9_B_0X1			(0x1u<<18)
#define	GPIOC_OSPEEDR_OSPEED9_B_0X2			(0x2u<<18)
#define	GPIOC_OSPEEDR_OSPEED9_B_0X3			(0x3u<<18)
#define	GPIOC_OSPEEDR_OSPEED8_B_0X0			(0x0u<<16)
#define	GPIOC_OSPEEDR_OSPEED8_B_0X1			(0x1u<<16)
#define	GPIOC_OSPEEDR_OSPEED8_B_0X2			(0x2u<<16)
#define	GPIOC_OSPEEDR_OSPEED8_B_0X3			(0x3u<<16)
#define	GPIOC_OSPEEDR_OSPEED7_B_0X0			(0x0u<<14)
#define	GPIOC_OSPEEDR_OSPEED7_B_0X1			(0x1u<<14)
#define	GPIOC_OSPEEDR_OSPEED7_B_0X2			(0x2u<<14)
#define	GPIOC_OSPEEDR_OSPEED7_B_0X3			(0x3u<<14)
#define	GPIOC_OSPEEDR_OSPEED6_B_0X0			(0x0u<<12)
#define	GPIOC_OSPEEDR_OSPEED6_B_0X1			(0x1u<<12)
#define	GPIOC_OSPEEDR_OSPEED6_B_0X2			(0x2u<<12)
#define	GPIOC_OSPEEDR_OSPEED6_B_0X3			(0x3u<<12)
#define	GPIOC_OSPEEDR_OSPEED5_B_0X0			(0x0u<<10)
#define	GPIOC_OSPEEDR_OSPEED5_B_0X1			(0x1u<<10)
#define	GPIOC_OSPEEDR_OSPEED5_B_0X2			(0x2u<<10)
#define	GPIOC_OSPEEDR_OSPEED5_B_0X3			(0x3u<<10)
#define	GPIOC_OSPEEDR_OSPEED4_B_0X0			(0x0u<<8)
#define	GPIOC_OSPEEDR_OSPEED4_B_0X1			(0x1u<<8)
#define	GPIOC_OSPEEDR_OSPEED4_B_0X2			(0x2u<<8)
#define	GPIOC_OSPEEDR_OSPEED4_B_0X3			(0x3u<<8)
#define	GPIOC_OSPEEDR_OSPEED3_B_0X0			(0x0u<<6)
#define	GPIOC_OSPEEDR_OSPEED3_B_0X1			(0x1u<<6)
#define	GPIOC_OSPEEDR_OSPEED3_B_0X2			(0x2u<<6)
#define	GPIOC_OSPEEDR_OSPEED3_B_0X3			(0x3u<<6)
#define	GPIOC_OSPEEDR_OSPEED2_B_0X0			(0x0u<<4)
#define	GPIOC_OSPEEDR_OSPEED2_B_0X1			(0x1u<<4)
#define	GPIOC_OSPEEDR_OSPEED2_B_0X2			(0x2u<<4)
#define	GPIOC_OSPEEDR_OSPEED2_B_0X3			(0x3u<<4)
#define	GPIOC_OSPEEDR_OSPEED1_B_0X0			(0x0u<<2)
#define	GPIOC_OSPEEDR_OSPEED1_B_0X1			(0x1u<<2)
#define	GPIOC_OSPEEDR_OSPEED1_B_0X2			(0x2u<<2)
#define	GPIOC_OSPEEDR_OSPEED1_B_0X3			(0x3u<<2)
#define	GPIOC_OSPEEDR_OSPEED0_B_0X0			(0x0u<<0)
#define	GPIOC_OSPEEDR_OSPEED0_B_0X1			(0x1u<<0)
#define	GPIOC_OSPEEDR_OSPEED0_B_0X2			(0x2u<<0)
#define	GPIOC_OSPEEDR_OSPEED0_B_0X3			(0x3u<<0)

// PUPDR Configuration

#define	GPIOC_PUPDR_PUPD15					(0x3u<<30)
#define	GPIOC_PUPDR_PUPD15_0				(0x1u<<30)
#define	GPIOC_PUPDR_PUPD14					(0x3u<<28)
#define	GPIOC_PUPDR_PUPD14_0				(0x1u<<28)
#define	GPIOC_PUPDR_PUPD13					(0x3u<<26)
#define	GPIOC_PUPDR_PUPD13_0				(0x1u<<26)
#define	GPIOC_PUPDR_PUPD12					(0x3u<<24)
#define	GPIOC_PUPDR_PUPD12_0				(0x1u<<24)
#define	GPIOC_PUPDR_PUPD11					(0x3u<<22)
#define	GPIOC_PUPDR_PUPD11_0				(0x1u<<22)
#define	GPIOC_PUPDR_PUPD10					(0x3u<<20)
#define	GPIOC_PUPDR_PUPD10_0				(0x1u<<20)
#define	GPIOC_PUPDR_PUPD9					(0x3u<<18)
#define	GPIOC_PUPDR_PUPD9_0					(0x1u<<18)
#define	GPIOC_PUPDR_PUPD8					(0x3u<<16)
#define	GPIOC_PUPDR_PUPD8_0					(0x1u<<16)
#define	GPIOC_PUPDR_PUPD7					(0x3u<<14)
#define	GPIOC_PUPDR_PUPD7_0					(0x1u<<14)
#define	GPIOC_PUPDR_PUPD6					(0x3u<<12)
#define	GPIOC_PUPDR_PUPD6_0					(0x1u<<12)
#define	GPIOC_PUPDR_PUPD5					(0x3u<<10)
#define	GPIOC_PUPDR_PUPD5_0					(0x1u<<10)
#define	GPIOC_PUPDR_PUPD4					(0x3u<<8)
#define	GPIOC_PUPDR_PUPD4_0					(0x1u<<8)
#define	GPIOC_PUPDR_PUPD3					(0x3u<<6)
#define	GPIOC_PUPDR_PUPD3_0					(0x1u<<6)
#define	GPIOC_PUPDR_PUPD2					(0x3u<<4)
#define	GPIOC_PUPDR_PUPD2_0					(0x1u<<4)
#define	GPIOC_PUPDR_PUPD1					(0x3u<<2)
#define	GPIOC_PUPDR_PUPD1_0					(0x1u<<2)
#define	GPIOC_PUPDR_PUPD0					(0x3u<<0)
#define	GPIOC_PUPDR_PUPD0_0					(0x1u<<0)

#define	GPIOC_PUPDR_PUPD15_B_0X0			(0x0u<<30)
#define	GPIOC_PUPDR_PUPD15_B_0X1			(0x1u<<30)
#define	GPIOC_PUPDR_PUPD15_B_0X2			(0x2u<<30)
#define	GPIOC_PUPDR_PUPD14_B_0X0			(0x0u<<28)
#define	GPIOC_PUPDR_PUPD14_B_0X1			(0x1u<<28)
#define	GPIOC_PUPDR_PUPD14_B_0X2			(0x2u<<28)
#define	GPIOC_PUPDR_PUPD13_B_0X0			(0x0u<<26)
#define	GPIOC_PUPDR_PUPD13_B_0X1			(0x1u<<26)
#define	GPIOC_PUPDR_PUPD13_B_0X2			(0x2u<<26)
#define	GPIOC_PUPDR_PUPD12_B_0X0			(0x0u<<24)
#define	GPIOC_PUPDR_PUPD12_B_0X1			(0x1u<<24)
#define	GPIOC_PUPDR_PUPD12_B_0X2			(0x2u<<24)
#define	GPIOC_PUPDR_PUPD11_B_0X0			(0x0u<<22)
#define	GPIOC_PUPDR_PUPD11_B_0X1			(0x1u<<22)
#define	GPIOC_PUPDR_PUPD11_B_0X2			(0x2u<<22)
#define	GPIOC_PUPDR_PUPD10_B_0X0			(0x0u<<20)
#define	GPIOC_PUPDR_PUPD10_B_0X1			(0x1u<<20)
#define	GPIOC_PUPDR_PUPD10_B_0X2			(0x2u<<20)
#define	GPIOC_PUPDR_PUPD9_B_0X0				(0x0u<<18)
#define	GPIOC_PUPDR_PUPD9_B_0X1				(0x1u<<18)
#define	GPIOC_PUPDR_PUPD9_B_0X2				(0x2u<<18)
#define	GPIOC_PUPDR_PUPD8_B_0X0				(0x0u<<16)
#define	GPIOC_PUPDR_PUPD8_B_0X1				(0x1u<<16)
#define	GPIOC_PUPDR_PUPD8_B_0X2				(0x2u<<16)
#define	GPIOC_PUPDR_PUPD7_B_0X0				(0x0u<<14)
#define	GPIOC_PUPDR_PUPD7_B_0X1				(0x1u<<14)
#define	GPIOC_PUPDR_PUPD7_B_0X2				(0x2u<<14)
#define	GPIOC_PUPDR_PUPD6_B_0X0				(0x0u<<12)
#define	GPIOC_PUPDR_PUPD6_B_0X1				(0x1u<<12)
#define	GPIOC_PUPDR_PUPD6_B_0X2				(0x2u<<12)
#define	GPIOC_PUPDR_PUPD5_B_0X0				(0x0u<<10)
#define	GPIOC_PUPDR_PUPD5_B_0X1				(0x1u<<10)
#define	GPIOC_PUPDR_PUPD5_B_0X2				(0x2u<<10)
#define	GPIOC_PUPDR_PUPD4_B_0X0				(0x0u<<8)
#define	GPIOC_PUPDR_PUPD4_B_0X1				(0x1u<<8)
#define	GPIOC_PUPDR_PUPD4_B_0X2				(0x2u<<8)
#define	GPIOC_PUPDR_PUPD3_B_0X0				(0x0u<<6)
#define	GPIOC_PUPDR_PUPD3_B_0X1				(0x1u<<6)
#define	GPIOC_PUPDR_PUPD3_B_0X2				(0x2u<<6)
#define	GPIOC_PUPDR_PUPD2_B_0X0				(0x0u<<4)
#define	GPIOC_PUPDR_PUPD2_B_0X1				(0x1u<<4)
#define	GPIOC_PUPDR_PUPD2_B_0X2				(0x2u<<4)
#define	GPIOC_PUPDR_PUPD1_B_0X0				(0x0u<<2)
#define	GPIOC_PUPDR_PUPD1_B_0X1				(0x1u<<2)
#define	GPIOC_PUPDR_PUPD1_B_0X2				(0x2u<<2)
#define	GPIOC_PUPDR_PUPD0_B_0X0				(0x0u<<0)
#define	GPIOC_PUPDR_PUPD0_B_0X1				(0x1u<<0)
#define	GPIOC_PUPDR_PUPD0_B_0X2				(0x2u<<0)

// IDR Configuration

#define	GPIOC_IDR_ID15						(0x1u<<15)
#define	GPIOC_IDR_ID14						(0x1u<<14)
#define	GPIOC_IDR_ID13						(0x1u<<13)
#define	GPIOC_IDR_ID12						(0x1u<<12)
#define	GPIOC_IDR_ID11						(0x1u<<11)
#define	GPIOC_IDR_ID10						(0x1u<<10)
#define	GPIOC_IDR_ID9						(0x1u<<9)
#define	GPIOC_IDR_ID8						(0x1u<<8)
#define	GPIOC_IDR_ID7						(0x1u<<7)
#define	GPIOC_IDR_ID6						(0x1u<<6)
#define	GPIOC_IDR_ID5						(0x1u<<5)
#define	GPIOC_IDR_ID4						(0x1u<<4)
#define	GPIOC_IDR_ID3						(0x1u<<3)
#define	GPIOC_IDR_ID2						(0x1u<<2)
#define	GPIOC_IDR_ID1						(0x1u<<1)
#define	GPIOC_IDR_ID0						(0x1u<<0)

// ODR Configuration

