hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gpioc.h
#define	GPIOC_RCFGLOCKR_RLOCK15				(0x1u<<15)
#define	GPIOC_RCFGLOCKR_RLOCK14				(0x1u<<14)
#define	GPIOC_RCFGLOCKR_RLOCK13				(0x1u<<13)
#define	GPIOC_RCFGLOCKR_RLOCK12				(0x1u<<12)
#define	GPIOC_RCFGLOCKR_RLOCK11				(0x1u<<11)
#define	GPIOC_RCFGLOCKR_RLOCK10				(0x1u<<10)
#define	GPIOC_RCFGLOCKR_RLOCK9				(0x1u<<9)
#define	GPIOC_RCFGLOCKR_RLOCK8				(0x1u<<8)
#define	GPIOC_RCFGLOCKR_RLOCK7				(0x1u<<7)
#define	GPIOC_RCFGLOCKR_RLOCK6				(0x1u<<6)
#define	GPIOC_RCFGLOCKR_RLOCK5				(0x1u<<5)
#define	GPIOC_RCFGLOCKR_RLOCK4				(0x1u<<4)
#define	GPIOC_RCFGLOCKR_RLOCK3				(0x1u<<3)
#define	GPIOC_RCFGLOCKR_RLOCK2				(0x1u<<2)
#define	GPIOC_RCFGLOCKR_RLOCK1				(0x1u<<1)
#define	GPIOC_RCFGLOCKR_RLOCK0				(0x1u<<0)

#define	GPIOC_RCFGLOCKR_RLOCK15_B_0X0		(0x0u<<15)
#define	GPIOC_RCFGLOCKR_RLOCK15_B_0X1		(0x1u<<15)
#define	GPIOC_RCFGLOCKR_RLOCK14_B_0X0		(0x0u<<14)
#define	GPIOC_RCFGLOCKR_RLOCK14_B_0X1		(0x1u<<14)
#define	GPIOC_RCFGLOCKR_RLOCK13_B_0X0		(0x0u<<13)
#define	GPIOC_RCFGLOCKR_RLOCK13_B_0X1		(0x1u<<13)
#define	GPIOC_RCFGLOCKR_RLOCK12_B_0X0		(0x0u<<12)
#define	GPIOC_RCFGLOCKR_RLOCK12_B_0X1		(0x1u<<12)
#define	GPIOC_RCFGLOCKR_RLOCK11_B_0X0		(0x0u<<11)
#define	GPIOC_RCFGLOCKR_RLOCK11_B_0X1		(0x1u<<11)
#define	GPIOC_RCFGLOCKR_RLOCK10_B_0X0		(0x0u<<10)
#define	GPIOC_RCFGLOCKR_RLOCK10_B_0X1		(0x1u<<10)
#define	GPIOC_RCFGLOCKR_RLOCK9_B_0X0		(0x0u<<9)
#define	GPIOC_RCFGLOCKR_RLOCK9_B_0X1		(0x1u<<9)
#define	GPIOC_RCFGLOCKR_RLOCK8_B_0X0		(0x0u<<8)
#define	GPIOC_RCFGLOCKR_RLOCK8_B_0X1		(0x1u<<8)
#define	GPIOC_RCFGLOCKR_RLOCK7_B_0X0		(0x0u<<7)
#define	GPIOC_RCFGLOCKR_RLOCK7_B_0X1		(0x1u<<7)
#define	GPIOC_RCFGLOCKR_RLOCK6_B_0X0		(0x0u<<6)
#define	GPIOC_RCFGLOCKR_RLOCK6_B_0X1		(0x1u<<6)
#define	GPIOC_RCFGLOCKR_RLOCK5_B_0X0		(0x0u<<5)
#define	GPIOC_RCFGLOCKR_RLOCK5_B_0X1		(0x1u<<5)
#define	GPIOC_RCFGLOCKR_RLOCK4_B_0X0		(0x0u<<4)
#define	GPIOC_RCFGLOCKR_RLOCK4_B_0X1		(0x1u<<4)
#define	GPIOC_RCFGLOCKR_RLOCK3_B_0X0		(0x0u<<3)
#define	GPIOC_RCFGLOCKR_RLOCK3_B_0X1		(0x1u<<3)
#define	GPIOC_RCFGLOCKR_RLOCK2_B_0X0		(0x0u<<2)
#define	GPIOC_RCFGLOCKR_RLOCK2_B_0X1		(0x1u<<2)
#define	GPIOC_RCFGLOCKR_RLOCK1_B_0X0		(0x0u<<1)
#define	GPIOC_RCFGLOCKR_RLOCK1_B_0X1		(0x1u<<1)
#define	GPIOC_RCFGLOCKR_RLOCK0_B_0X0		(0x0u<<0)
#define	GPIOC_RCFGLOCKR_RLOCK0_B_0X1		(0x1u<<0)

// DELAYRL Configuration

#define	GPIOC_DELAYRL_DELAY7				(0xFu<<28)
#define	GPIOC_DELAYRL_DELAY7_0				(0x1u<<28)
#define	GPIOC_DELAYRL_DELAY6				(0xFu<<24)
#define	GPIOC_DELAYRL_DELAY6_0				(0x1u<<24)
#define	GPIOC_DELAYRL_DELAY5				(0xFu<<20)
#define	GPIOC_DELAYRL_DELAY5_0				(0x1u<<20)
#define	GPIOC_DELAYRL_DELAY4				(0xFu<<16)
#define	GPIOC_DELAYRL_DELAY4_0				(0x1u<<16)
#define	GPIOC_DELAYRL_DELAY3				(0xFu<<12)
#define	GPIOC_DELAYRL_DELAY3_0				(0x1u<<12)
#define	GPIOC_DELAYRL_DELAY2				(0xFu<<8)
#define	GPIOC_DELAYRL_DELAY2_0				(0x1u<<8)
#define	GPIOC_DELAYRL_DELAY1				(0xFu<<4)
#define	GPIOC_DELAYRL_DELAY1_0				(0x1u<<4)
#define	GPIOC_DELAYRL_DELAY0				(0xFu<<0)
#define	GPIOC_DELAYRL_DELAY0_0				(0x1u<<0)

#define	GPIOC_DELAYRL_DELAY7_B_0X0			(0x0u<<28)
#define	GPIOC_DELAYRL_DELAY7_B_0X1			(0x1u<<28)
#define	GPIOC_DELAYRL_DELAY7_B_0X2			(0x2u<<28)
#define	GPIOC_DELAYRL_DELAY7_B_0X3			(0x3u<<28)
#define	GPIOC_DELAYRL_DELAY7_B_0X4			(0x4u<<28)
#define	GPIOC_DELAYRL_DELAY7_B_0X5			(0x5u<<28)
#define	GPIOC_DELAYRL_DELAY7_B_0X6			(0x6u<<28)
#define	GPIOC_DELAYRL_DELAY7_B_0X7			(0x7u<<28)
#define	GPIOC_DELAYRL_DELAY7_B_0X8			(0x8u<<28)
#define	GPIOC_DELAYRL_DELAY7_B_0X9			(0x9u<<28)
#define	GPIOC_DELAYRL_DELAY7_B_0XA			(0xAu<<28)
#define	GPIOC_DELAYRL_DELAY7_B_0XB			(0xBu<<28)
#define	GPIOC_DELAYRL_DELAY7_B_0XC			(0xCu<<28)
#define	GPIOC_DELAYRL_DELAY7_B_0XD			(0xDu<<28)
#define	GPIOC_DELAYRL_DELAY6_B_0X0			(0x0u<<24)
#define	GPIOC_DELAYRL_DELAY6_B_0X1			(0x1u<<24)
#define	GPIOC_DELAYRL_DELAY6_B_0X2			(0x2u<<24)
#define	GPIOC_DELAYRL_DELAY6_B_0X3			(0x3u<<24)
#define	GPIOC_DELAYRL_DELAY6_B_0X4			(0x4u<<24)
#define	GPIOC_DELAYRL_DELAY6_B_0X5			(0x5u<<24)
#define	GPIOC_DELAYRL_DELAY6_B_0X6			(0x6u<<24)
#define	GPIOC_DELAYRL_DELAY6_B_0X7			(0x7u<<24)
#define	GPIOC_DELAYRL_DELAY6_B_0X8			(0x8u<<24)
#define	GPIOC_DELAYRL_DELAY6_B_0X9			(0x9u<<24)
#define	GPIOC_DELAYRL_DELAY6_B_0XA			(0xAu<<24)
#define	GPIOC_DELAYRL_DELAY6_B_0XB			(0xBu<<24)
#define	GPIOC_DELAYRL_DELAY6_B_0XC			(0xCu<<24)
#define	GPIOC_DELAYRL_DELAY6_B_0XD			(0xDu<<24)
#define	GPIOC_DELAYRL_DELAY5_B_0X0			(0x0u<<20)
#define	GPIOC_DELAYRL_DELAY5_B_0X1			(0x1u<<20)
#define	GPIOC_DELAYRL_DELAY5_B_0X2			(0x2u<<20)
#define	GPIOC_DELAYRL_DELAY5_B_0X3			(0x3u<<20)
#define	GPIOC_DELAYRL_DELAY5_B_0X4			(0x4u<<20)
#define	GPIOC_DELAYRL_DELAY5_B_0X5			(0x5u<<20)
#define	GPIOC_DELAYRL_DELAY5_B_0X6			(0x6u<<20)
#define	GPIOC_DELAYRL_DELAY5_B_0X7			(0x7u<<20)
#define	GPIOC_DELAYRL_DELAY5_B_0X8			(0x8u<<20)
#define	GPIOC_DELAYRL_DELAY5_B_0X9			(0x9u<<20)
#define	GPIOC_DELAYRL_DELAY5_B_0XA			(0xAu<<20)
#define	GPIOC_DELAYRL_DELAY5_B_0XB			(0xBu<<20)
#define	GPIOC_DELAYRL_DELAY5_B_0XC			(0xCu<<20)
#define	GPIOC_DELAYRL_DELAY5_B_0XD			(0xDu<<20)
#define	GPIOC_DELAYRL_DELAY4_B_0X0			(0x0u<<16)
#define	GPIOC_DELAYRL_DELAY4_B_0X1			(0x1u<<16)
#define	GPIOC_DELAYRL_DELAY4_B_0X2			(0x2u<<16)
#define	GPIOC_DELAYRL_DELAY4_B_0X3			(0x3u<<16)
#define	GPIOC_DELAYRL_DELAY4_B_0X4			(0x4u<<16)
#define	GPIOC_DELAYRL_DELAY4_B_0X5			(0x5u<<16)
#define	GPIOC_DELAYRL_DELAY4_B_0X6			(0x6u<<16)
#define	GPIOC_DELAYRL_DELAY4_B_0X7			(0x7u<<16)
#define	GPIOC_DELAYRL_DELAY4_B_0X8			(0x8u<<16)
#define	GPIOC_DELAYRL_DELAY4_B_0X9			(0x9u<<16)
#define	GPIOC_DELAYRL_DELAY4_B_0XA			(0xAu<<16)
#define	GPIOC_DELAYRL_DELAY4_B_0XB			(0xBu<<16)
#define	GPIOC_DELAYRL_DELAY4_B_0XC			(0xCu<<16)
#define	GPIOC_DELAYRL_DELAY4_B_0XD			(0xDu<<16)
#define	GPIOC_DELAYRL_DELAY3_B_0X0			(0x0u<<12)
#define	GPIOC_DELAYRL_DELAY3_B_0X1			(0x1u<<12)
#define	GPIOC_DELAYRL_DELAY3_B_0X2			(0x2u<<12)
#define	GPIOC_DELAYRL_DELAY3_B_0X3			(0x3u<<12)
#define	GPIOC_DELAYRL_DELAY3_B_0X4			(0x4u<<12)
#define	GPIOC_DELAYRL_DELAY3_B_0X5			(0x5u<<12)
#define	GPIOC_DELAYRL_DELAY3_B_0X6			(0x6u<<12)
#define	GPIOC_DELAYRL_DELAY3_B_0X7			(0x7u<<12)
#define	GPIOC_DELAYRL_DELAY3_B_0X8			(0x8u<<12)
#define	GPIOC_DELAYRL_DELAY3_B_0X9			(0x9u<<12)
#define	GPIOC_DELAYRL_DELAY3_B_0XA			(0xAu<<12)
#define	GPIOC_DELAYRL_DELAY3_B_0XB			(0xBu<<12)
#define	GPIOC_DELAYRL_DELAY3_B_0XC			(0xCu<<12)
#define	GPIOC_DELAYRL_DELAY3_B_0XD			(0xDu<<12)
#define	GPIOC_DELAYRL_DELAY2_B_0X0			(0x0u<<8)
#define	GPIOC_DELAYRL_DELAY2_B_0X1			(0x1u<<8)
#define	GPIOC_DELAYRL_DELAY2_B_0X2			(0x2u<<8)
#define	GPIOC_DELAYRL_DELAY2_B_0X3			(0x3u<<8)
#define	GPIOC_DELAYRL_DELAY2_B_0X4			(0x4u<<8)
#define	GPIOC_DELAYRL_DELAY2_B_0X5			(0x5u<<8)
#define	GPIOC_DELAYRL_DELAY2_B_0X6			(0x6u<<8)
#define	GPIOC_DELAYRL_DELAY2_B_0X7			(0x7u<<8)
#define	GPIOC_DELAYRL_DELAY2_B_0X8			(0x8u<<8)
#define	GPIOC_DELAYRL_DELAY2_B_0X9			(0x9u<<8)
#define	GPIOC_DELAYRL_DELAY2_B_0XA			(0xAu<<8)
#define	GPIOC_DELAYRL_DELAY2_B_0XB			(0xBu<<8)
#define	GPIOC_DELAYRL_DELAY2_B_0XC			(0xCu<<8)
#define	GPIOC_DELAYRL_DELAY2_B_0XD			(0xDu<<8)
#define	GPIOC_DELAYRL_DELAY1_B_0X0			(0x0u<<4)
#define	GPIOC_DELAYRL_DELAY1_B_0X1			(0x1u<<4)
#define	GPIOC_DELAYRL_DELAY1_B_0X2			(0x2u<<4)
#define	GPIOC_DELAYRL_DELAY1_B_0X3			(0x3u<<4)
#define	GPIOC_DELAYRL_DELAY1_B_0X4			(0x4u<<4)
#define	GPIOC_DELAYRL_DELAY1_B_0X5			(0x5u<<4)
#define	GPIOC_DELAYRL_DELAY1_B_0X6			(0x6u<<4)
#define	GPIOC_DELAYRL_DELAY1_B_0X7			(0x7u<<4)
#define	GPIOC_DELAYRL_DELAY1_B_0X8			(0x8u<<4)
#define	GPIOC_DELAYRL_DELAY1_B_0X9			(0x9u<<4)
#define	GPIOC_DELAYRL_DELAY1_B_0XA			(0xAu<<4)
#define	GPIOC_DELAYRL_DELAY1_B_0XB			(0xBu<<4)
#define	GPIOC_DELAYRL_DELAY1_B_0XC			(0xCu<<4)
#define	GPIOC_DELAYRL_DELAY1_B_0XD			(0xDu<<4)
#define	GPIOC_DELAYRL_DELAY0_B_0X0			(0x0u<<0)
#define	GPIOC_DELAYRL_DELAY0_B_0X1			(0x1u<<0)
#define	GPIOC_DELAYRL_DELAY0_B_0X2			(0x2u<<0)
#define	GPIOC_DELAYRL_DELAY0_B_0X3			(0x3u<<0)
#define	GPIOC_DELAYRL_DELAY0_B_0X4			(0x4u<<0)
#define	GPIOC_DELAYRL_DELAY0_B_0X5			(0x5u<<0)
#define	GPIOC_DELAYRL_DELAY0_B_0X6			(0x6u<<0)
#define	GPIOC_DELAYRL_DELAY0_B_0X7			(0x7u<<0)
#define	GPIOC_DELAYRL_DELAY0_B_0X8			(0x8u<<0)
#define	GPIOC_DELAYRL_DELAY0_B_0X9			(0x9u<<0)
#define	GPIOC_DELAYRL_DELAY0_B_0XA			(0xAu<<0)
#define	GPIOC_DELAYRL_DELAY0_B_0XB			(0xBu<<0)
#define	GPIOC_DELAYRL_DELAY0_B_0XC			(0xCu<<0)
#define	GPIOC_DELAYRL_DELAY0_B_0XD			(0xDu<<0)

